; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem2)
  (:domain emergency-services)
  (:objects
    d1 - drone
    depot loc1 loc2 - location
    p1 p2 - person
    c1 c2 c3 - crate
    food medicine - content
    left right - arm
  )
  (:init
    (at-drone d1 depot)
    (at-crate c1 depot)
    (at-crate c2 depot)
    (at-crate c3 depot)
    (at-person p1 loc1)
    (at-person p2 loc2)
    (crate-content c1 food)
    (crate-content c2 medicine)
    (crate-content c3 food)
    (hand-empty d1 left)
    (hand-empty d1 right)
  )
  (:goal
    (and
      (has-content p1 food)
      (has-content p2 medicine)
    )
  )
)

; plan
1. (pick-up d1 right c1 depot)
   deleted: (at-crate c1 depot) (hand-empty d1 right)
   added: (holding d1 right c1)
   goals met: 0 of 2
2. (pick-up d1 left c2 depot)
   deleted: (at-crate c2 depot) (hand-empty d1 left)
   added: (holding d1 left c2)
   goals met: 0 of 2
3. (fly d1 depot loc1)
   deleted: (at-drone d1 depot)
   added: (at-drone d1 loc1)
   goals met: 0 of 2
4. (deliver d1 right c1 p1 loc1 food)
   deleted: (holding d1 right c1)
   added: (hand-empty d1 right) (has-content p1 food)
   goals met: 1 of 2
5. (fly d1 loc1 loc2)
   deleted: (at-drone d1 loc1)
   added: (at-drone d1 loc2)
   goals met: 1 of 2
6. (deliver d1 left c2 p2 loc2 medicine)
   deleted: (holding d1 left c2)
   added: (hand-empty d1 left) (has-content p2 medicine)
   goals met: 2 of 2
